xml1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns="http://www.europaeische.at/2009/04">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:V4InsuranceContractRQ>
            <ns:providerNumber>50008000</ns:providerNumber>
            <ns:integratorNumber>50008000</ns:integratorNumber>
            <ns:agencyNumber>ERV_TEST</ns:agencyNumber>
            <ns:token>761-31365</ns:token>
            <ns:testMode>true</ns:testMode>
            <ns:externalReferenceNumber>049997103-2783-2568-20210123</ns:externalReferenceNumber>
            <ns:insuranceHolder>
                <ns:salutationCode>0</ns:salutationCode>
                <ns:title>aMeister</ns:title>
                <ns:firstName>aEin</ns:firstName>
                <ns:lastName>aUngeheuer</ns:lastName>
                <ns:street>aGruselstr.</ns:street>
                <ns:zipCode>a99999</ns:zipCode>
                <ns:city>irgendwo</ns:city>
                <ns:countryCode>YY</ns:countryCode>
                <ns:mobile>123456</ns:mobile>
                <ns:phone>488448844</ns:phone>
                <ns:email>nix@gud.de</ns:email>
            </ns:insuranceHolder>
            <ns:insuredPerson>
                <ns:title></ns:title>
                <ns:firstName>SALETTI</ns:firstName>
                <ns:lastName>SALAMI</ns:lastName>
                <ns:dayOfBirth>1992-02-01</ns:dayOfBirth>
                <ns:index>1</ns:index>
            </ns:insuredPerson>
            <ns:insuredPerson>
                <ns:title></ns:title>
                <ns:firstName>SANNE</ns:firstName>
                <ns:lastName>SALAMI</ns:lastName>
                <ns:dayOfBirth>1980-10-05</ns:dayOfBirth>
                <ns:index>2</ns:index>
            </ns:insuredPerson>
            <ns:additionalContractData>
                <ns:shortData>
                    <ns:tripStartDate>2021-02-16</ns:tripStartDate>
                </ns:shortData>
            </ns:additionalContractData>
            <ns:preContractEmailReceiver>
                <ns:emailReceiver>sven.lindow@bosys.info</ns:emailReceiver>
            </ns:preContractEmailReceiver>
        </ns:V4InsuranceContractRQ>
    </soapenv:Body>
</soapenv:Envelope>